IDEA StatiCa Open Model
CrossSectionFactory.FillRectangle Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Rectangle shape - massive concrete shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillRectangle(
	CrossSectionParameter css,
	double width,
	double height
)
Public Shared Sub FillRectangle (
	css As CrossSectionParameter,
	width As Double,
	height As Double
)
public:
static void FillRectangle(
	CrossSectionParameter^ css,
	double width,
	double height
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
width
Type: System.Double
Width of the rectangle
height
Type: System.Double
Height of the rectangle
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace